{"id":738,"date":"2017-04-17T14:07:06","date_gmt":"2017-04-17T21:07:06","guid":{"rendered":"http:\/\/www.teledirect.com\/?p=738"},"modified":"2022-11-07T10:39:08","modified_gmt":"2022-11-07T18:39:08","slug":"telecom-customer-service","status":"publish","type":"post","link":"https:\/\/www.teledirect.com\/news\/telecom-customer-service\/","title":{"rendered":"Industry Interview: How Telecom Companies Deliver Exceptional Customer Service"},"content":{"rendered":"<p>In the telecommunications industry, the “communication” part isn’t always easy, especially between providers and clients. Sometimes, an unorthodox approach is desired – even necessary. The present state of virtual communications – building trust and ensuring satisfaction without actual face-to-face meetings – provides plenty of challenges, but three different companies (<a href=\"https:\/\/www.teledirect.com\/\">TeleDirect<\/a>, <a href=\"https:\/\/www.messagingservice.com\/\" target=\"_blank\" rel=\"noopener\">Access Direct<\/a> and <a href=\"https:\/\/globafone.com\/\" target=\"_blank\" rel=\"noopener\">Globafone<\/a>) have managed to thrive in this ever-perilous environment.<\/p>\n<p>Smitha Baliga (CEO of TeleDirect), John Kinskey (President &amp; Founder of Access Direct) and Louis Altman (Founder &amp; CEOI of Globafone) recently spoke about building relationships with customers, delivering top-notch customer service and the keys to making virtual communications work.<\/p>\n<h2>How important is customer service?<\/h2>\n<p>Smitha Baliga, CEO of TeleDirect, believes that good customer service isn’t just important, it’s vital. According to Ms. Baliga, “Irrespective of the size of your business, good customer service needs to be at the heart of your business model if you wish to be successful. Good customer service leads to customer satisfaction which can generate positive word-of-mouth for your business and help your business grow and prosper. Customers are willing to pay more for a better experience. It reflects heavily on your entire business and is a great marketing tool.”<\/p>\n<p>TeleDirect also stresses the “The Moment of Truth,” the critical and definitive moment when their client’s customers engage with their call center personnel for the first time. You never get a second chance to make a first impression, as the saying goes, and TeleDirect uses this urgency to improve their customer service model.<\/p>\n<p><strong>John Kinskey<\/strong>, President and Founder of Access Direct, uses customer service to distinguish his company’s services from industry competitors. According to Mr. Kinskey, “I have always felt that our customer service sets us apart from the other companies in our field. Many large companies offering virtual phone systems for small businesses do so with a hands-off approach, expecting all small business owners to be fluent in the technical side of the business as well as running the business itself. This hands-off approach may work for a large company with a dedicated IT staff, but for a one-to-five-person business, it can be a very high bar to clear.”<\/p>\n<p>A dedicated support team is also crucial for Access Direct’s success. With a dedicated support team, the company provides value and shows commitment to their client’s success. Plus, this “go the extra mile” mentality also reduces the initial pressure of learning a new system. For a busy client, that type of service is hard to put a price tag on.<\/p>\n<p>For some executives, customer service is everything. “It is our lifeblood,” said <strong>Louis Altman<\/strong>, Founder &amp; CEOI of Globafone. “If you are selling the same exact product as every competitor, you need to do something different and better and special”<\/p>\n<p>From Mr. Altman’s perspective, price-cutting only goes so far, due to the product similarity within the telecommunication industry. That’s where superior customer service comes into play. “If your customers know you stand behind what you sell, they are willing to pay a little more,” said Mr. Altman.<\/p>\n<p>&nbsp;<\/p>\n<h2>Customer service and remote communication: delivering when you’re <u>not<\/u> up close and personal.<\/h2>\n<p>Providing your clients and customers value – even when you’re not directly across the table – provides daily challenges to the telecommunication industry. How do business leaders bridge the gap?<\/p>\n<p>Mr. Kinskey believes timing is crucial “Prompt response time is key. When you don’t have the customer in front of you, it’s important to reply to their concerns quickly and efficiently,” explained Mr. Kinskey. In other words, don’t let the distance scare you. It’s the time that should concern you. According to Mr. Kinskey, time is a huge trust-builder when client communication isn’t face-to-face.<\/p>\n<p>Ms. Baliga believes that when communications aren’t face-to-face, words and tone carry all the weight. “We have our call center representatives be cheerful and polite when they talk.  Smiling when you talk on the phone helps your voice to sound friendly, warm and receptive. TeleDirect believes in prompt and effective communication with our clients. Our client support team is in constant touch with our clients and they work on providing timely and effective solutions,” said Ms. Baliga.<\/p>\n<p>And don’t forget the importance of educating your customers. Globafone’s hallmark customer service includes education. “We want our clients to understand the nuances of the industry so they can make the best choice when it is time.  Free education is a HUGE differentiator as is keeping the client’s goals in mind. Customers who aren’t directly across the table benefit from learning about the industry they’re in,” said Mr. Altman. To help bolster Globafone’s educational tools, they’ve developed learning modules and other educational resources to help solidify trust and set the foundation for a long-term business relationship.<\/p>\n<p>&nbsp;<\/p>\n<h2>Building successful relationships with customers.<\/h2>\n<p>Mr. Altman’s stresses a simple, straightforward approach, along with an open mind about his customers’ concerns. “Focus on their goals and find the solution that solves the problem. Listen, acknowledge, and always offer help,” Mr. Altman said. For Globafone, this also involves utilizing their considerable educational resources. The company makes an effort to enhance the educational process, which complements their new products and services. Customer loyalty should also be recognized and rewarded. “When there is a better deal, give it to them.  The longer a client stays, the better deal they get,” concluded Mr. Altman.<\/p>\n<p>In order to build a strong relationship with your customer, you need to know your customer – which involves listening. “Honestly, it’s as easy as that,” said Mr. Kinskey. “Listen to their concerns; really hear what they are saying; and absorb that knowledge and refer to it during interactions with that customer. An effective solution to customer concerns starts with an attentive ear.”<\/p>\n<p>“Trust, integrity and commitment are essential ingredients for successful long-term relationships. TeleDirect has always had a singular vision &#8211; to create a business where the customer comes first. We have strived every day to meet this vision, and to build our team with this mantra always in mind. At TeleDirect, we take the time to learn and understand our customers. We practice active listening skills, and provide effective solutions to our clients. We always have the client’s best interest in mind. Loyal customers are your best sales people”, said Ms. Baliga.<\/p>\n<p>At TeleDirect, this approach has defined the entire business model for our complete <a href=\"https:\/\/www.teledirect.com\/services\/\">business process outsourcing (BPO) solutions<\/a>. For more information, please call us at (800) 776-1081. Experience a different level of customer service – contact us today!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the telecommunications industry, the “communication” part isn’t always easy, especially between providers and clients. Sometimes, an unorthodox approach is desired – even necessary. The&#8230;<\/p>\n","protected":false},"author":8,"featured_media":741,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":"","footnotes":""},"categories":[15],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/posts\/738"}],"collection":[{"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/users\/8"}],"replies":[{"embeddable":true,"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/comments?post=738"}],"version-history":[{"count":0,"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/posts\/738\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/media\/741"}],"wp:attachment":[{"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/media?parent=738"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/categories?post=738"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/tags?post=738"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}