{"id":131,"date":"2022-02-08T05:20:09","date_gmt":"2022-02-08T13:20:09","guid":{"rendered":"https:\/\/www.teledirect.com\/?page_id=131"},"modified":"2022-06-23T17:00:40","modified_gmt":"2022-06-24T00:00:40","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/www.teledirect.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"<div id=\"pl-131\"  class=\"panel-layout\" ><div id=\"pg-131-0\"  class=\"panel-grid panel-has-style\" ><div class=\"siteorigin-panels-stretch panel-row-style panel-row-style-for-131-0\" id=\"featured-image\" data-stretch-type=\"full-stretched\" ><div id=\"pgc-131-0-0\"  class=\"panel-grid-cell panel-grid-cell-empty\" ><\/div><\/div><\/div><div id=\"pg-131-1\"  class=\"panel-grid panel-no-style\" ><div id=\"pgc-131-1-0\"  class=\"panel-grid-cell\" ><div id=\"panel-131-1-0-0\" class=\"so-panel widget widget_sow-editor panel-first-child panel-last-child\" data-index=\"0\" ><div\n\t\t\t\n\t\t\tclass=\"so-widget-sow-editor so-widget-sow-editor-base\"\n\t\t\t\n\t\t>\n<div class=\"siteorigin-widget-tinymce textwidget\">\n\t<h1 style=\"text-align: center;\">Privacy Policy<\/h1>\n<p style=\"text-align: center;\"><em>(revised effective June 23rd, 2022)<\/em><\/p>\n<p>TeleDirect Call Centers (“Tele-Direct”) has implemented the following Privacy Policy because we are committed to the protection of our customers’ privacy. This Privacy Policy applies to the information TeleDirect collects from its customers at www.teledirect.com (the “Site”) in connection with the services we provide. This Privacy Policy discloses our practice with respect to the collection and subsequent use of our customers’ personal information. This Policy does not apply to the practices of companies that Tele-Direct does not own or control, or to people that Tele-Direct does not employ or manage.<\/p>\n<p><strong>Information Collection and Use<\/strong><\/p>\n<p>We do not collect personal information about you unless you choose to provide that information to us or you choose a service on this Site where gathering personal information is necessary in order to deliver the specific services. We only collect the information that we actually need. Some of that is information that you actively give us when you sign up for an account, register for an event, ask for customer support, or use any other services offered by us. If you voluntarily contact us regarding Tele-Direct services, we may collect the following categories of personal information: your name, company name, telephone number, email address and mailing address, as well as a login name and password. When you create a new account within one of our three platforms, Seminar Edge™, Work The Lead™, and TUFC™, we again collect personal information from you including your name, company name, telephone number, email address and mailing address. Further, when you create a new campaign or seminar and are ready to begin using our services, we collect billing information such as billing name, billing address, and credit card number.<\/p>\n<p>The personal information we collect from you will be used by Tele-Direct to provide the service or carry out the transaction you have requested or authorized. This may include using the personal information to provide you with important information about the product or service that you are using, including critical updates and notifications via e-mail or regular mail. In addition, Tele-Direct may share or transfer information about you that you have provided to Tele-Direct to one or more third party entities pursuant to a sale, merger, assignment, joint venture or other transfer or disposition of a portion, or all of, the assets or stock of Tele-Direct.<\/p>\n<p>In some instances, we may include certain links in our e-mails that will allow us to monitor whether you access specific content in that e-mail. When you click on one of these links, we will record that click and certain activities on the Site associated with that link. We use this information to conduct internal research on our users’ demographics and interests, and to better serve you. This information is collected in aggregate form and is not related to your personally identifiable information.<\/p>\n<p>We use log files to track system activity and maintain our systems. Log data includes IP addresses, browser type, referring and exit pages, platform type, date and time stamps, and number and nature of clicks through our Site. We use this information to analyze usage patterns, observe trends, administer the Site, and gather broad demographic information for aggregate use. Log files are not linked to personally identifiable information.<\/p>\n<p>Personally identifiable information collected by Tele-Direct will be stored and processed in the United States. The European Economic Area (EEA) provides certain rights to data subjects (including access, rectification, erasure, restriction of processing, data portability, and the right to object and to complain). TeleDirect undertakes to provide you the same rights no matter where you choose to live.<\/p>\n<p>We keep your personal information for as long as it is required for the purposes stated in this Privacy Policy. When we no longer have a legitimate need to process your information, we will delete, anonymize, or isolate your information, whichever is appropriate.<\/p>\n<p><strong data-redactor-tag=\"strong\">Cookies<\/strong><\/p>\n<p>A cookie is a text file that is placed on your hard disk by a web page server. We may place cookies or similar files on your hard drive to facilitate site navigation and use. Our cookies do not identify you as an individual. Many web browsers are automatically set to accept cookies. You may change your browser settings to either reject cookies or notify you when a cookie is about to be placed on your computer. Please note, however, that rejecting cookies while visiting the Tele-Direct Site may result in certain parts of the Tele-Direct Site not operating correctly or as efficiently as if they were allowed.<\/p>\n<p><strong>Children<\/strong><\/p>\n<p>Please note that the Tele-Direct Site is a general audience web site. If you are under 13 years of age, you should not register with us or provide information on this Site. We do not collect personal information from any person about whom we actually know is under the age of 13.<\/p>\n<p><strong data-redactor-tag=\"strong\">Information Sharing and Disclosure<\/strong><\/p>\n<p>Tele-Direct will not sell, rent, or lease mailing lists or other user data to others. We will not share personal information about you with other people or nonaffiliated companies except to provide you with the services that you have requested, when we have your permission, or under the following circumstances: Tele-Direct will share your personal information with its trusted business partner, Salesforce.com, Inc. and its subsidiaries, in conjunction with Salesforce.com, Inc.’s application-sharing service. Most of our products and services support integrations with third-party products and services. If you choose to enable any third-party integrations, you may be allowing the third party to access your service information and personal information about you. We encourage you to review the privacy practices of the third-party services and products before you enable integrations with such third parties. TeleDirect may disclose personally identifiable information when we believe that the law requires it, such as in response to subpoenas, court orders, or other legal processes, or to establish or exercise our legal rights or defend against legal claims. In addition, Tele-Direct may share information we collect with companies that market our services or other third-parties that assist us with essential services such as data processing or servicing accounts. We are permitted by law to share the information we collect with these companies and you are not able to opt-out of these disclosures.<\/p>\n<p>The Tele-Direct web site may provide hyperlinks to other web sites. Please be aware that when you click on one of those links, you will be directed to a web site different from the Tele-Direct Site, even if a Tele-Direct logo, banner, or tool bar is still visible. Information you provide on other web sites is subject to collection by those other sites, not Tele-Direct. We encourage you to read the privacy statements of those linked sites as their privacy policies may differ from ours.<\/p>\n<p><strong>Security Measures and Our Commitment to Security<\/strong><\/p>\n<p>Tele-Direct has adopted security measures to ensure the security and integrity of its customers’ personal data. These security measures protect your personally identifiable information from loss, misuse or alteration. We restrict access to the Tele-Direct server and the personal information we store there by using a log-in process. When customers sign-up for an account with Tele-Direct, they select a unique username and password. Each time a customer attempts to access its account, the customer is required to provide its selected username and password.<\/p>\n<p>TeleDirect has been a certified member of the International Standards Organization (ISO) in the past. Currently we follow our own internal security protocol and controls that is audited and monitored by our IT team to ensure the highest security standards. TeleDirect is committed to the safety and security of all<br \/>\nconfidential material both physical and electronic. All physical and electronic information is held and processed within the United States of America. All electronic information is stored securely on AWS with integrated redundancy, system backups and offsite storage.<\/p>\n<p>TeleDirect constantly audits, monitors, and tests all systems. We regularly upgrade all systems to ensure best security practices are maintained. We also invest in consistent training of all team members around privacy and security best practices. Our commitment to security and confidentiality ensures that our clients<br \/>\ncan rest assured in the knowledge that we treat all confidential information with the highest integrity. We are ISO compliant, HIPPAA and PCI compliant as well. We take data security very seriously. We have taken steps to implement appropriate administrative, technical &amp; physical safeguards to prevent unauthorized access, use, modification, disclosure or destruction of the information you entrust to us. If you have any<br \/>\nconcerns regarding the security of your data, you can reach out to our Data Protection Officer by sending an email to <a href=\"mailto:systems@teledirect.com\">systems@teledirect.com<\/a> or sending us a letter at TeleDirect Call Centers, 4745 Chippendale Dr, Sacramento, CA 95841, USA.<\/p>\n<p><strong>Data Protection Officer<\/strong><\/p>\n<p>We have appointed a Data Protection Officer to oversee our management of your personal information in accordance with this Privacy Policy. If you have any questions or concerns about our privacy practices with respect to your personal information, you can reach out to our Data Protection Officer by sending an email to <a href=\"mailto:systems@teledirect.com\">systems@teledirect.com<\/a> or sending us a letter at TeleDirect Call Centers, Attn: Smitha Baliga 4745 Chippendale Dr, Sacramento, CA 95841, USA.<\/p>\n<p><strong>California Do Not Track<\/strong><\/p>\n<p>Our web services do not alter, change, or respond upon receiving Do Not Track (DNT) requests or signals in browsers. As described in more detail above, we track user activity using web server logs, cookies and similar technologies. Information collected in web server logs helps us analyze website usage and improve<br \/>\nthe user’s experience. Cookies allow us to offer you a customized experience and present relevant advertising to you.<\/p>\n<p><strong>Editing, Deleting Account Information and\/or opt out of future communications<\/strong><\/p>\n<p>You may opt out of any future contacts from us at any time. Contact us via our phone number, contact form or sending us a letter at TeleDirect Call Centers 4745 Chippendale Dr, Sacramento, CA 95841, USA at any time to:<\/p>\n<ul>\n<li>see what data we have about you, if any;<\/li>\n<li>change\/correct any data we have about you;<\/li>\n<li>ask us to delete any data we have about you; and\/or<\/li>\n<li>opt out of future communications from us.<\/li>\n<\/ul>\n<p>If you have any additional questions or concerns about this privacy policy, please contact us via our phone number, contact form or sending us a letter at TeleDirect Call Centers 4745 Chippendale Dr, Sacramento, CA 95841, USA.<\/p>\n<p><strong>Notification of Changes and Your Acceptance of the Privacy Policy<\/strong><\/p>\n<p>By using this Web Site, you signify your agreement to the terms of this Privacy Policy. If there are material changes to our Privacy Policy or if we decide to use personally identifiable information in a manner different from that stated when it was collected, we will post a link to our revised Privacy Policy on our home page so our users are always aware of what information we collect, how we use it, and under what circumstances, if any, we disclose it. Your continued use of this Site shall constitute your acceptance of any revised privacy policy.<\/p>\n<p><strong data-redactor-tag=\"strong\">Contact Information<\/strong><\/p>\n<p>If you have any questions regarding this Privacy Policy, or privacy issues in general, please feel free to contact us by email at <a href=\"mailto:sales@teledirect.com\">sales@teledirect.com<\/a> or by mail at TeleDirect Call Centers, Attn: Smitha Baliga, 4745 Chippendale Dr, Sacramento, CA 95841, USA.<\/p>\n<\/div>\n<\/div><\/div><\/div><\/div><\/div>","protected":false},"excerpt":{"rendered":"<p>Privacy Policy (revised effective June 23rd, 2022) TeleDirect Call Centers (“Tele-Direct”) has implemented the following Privacy Policy because we are committed to the protection of&#8230;<\/p>\n","protected":false},"author":5,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":"","footnotes":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/pages\/131"}],"collection":[{"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/comments?post=131"}],"version-history":[{"count":0,"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/pages\/131\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/media?parent=131"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}