{"id":132,"date":"2016-06-20T08:20:18","date_gmt":"2016-06-20T08:20:18","guid":{"rendered":"https:\/\/www.teledirect.com\/?page_id=132"},"modified":"2021-09-08T16:50:13","modified_gmt":"2021-09-08T23:50:13","slug":"terms-of-use","status":"publish","type":"page","link":"https:\/\/www.teledirect.com\/terms-of-use\/","title":{"rendered":"Terms of Use"},"content":{"rendered":"<div id=\"pl-132\"  class=\"panel-layout\" ><div id=\"pg-132-0\"  class=\"panel-grid panel-has-style\" ><div class=\"siteorigin-panels-stretch panel-row-style panel-row-style-for-132-0\" id=\"featured-image\" data-stretch-type=\"full-stretched\" ><div id=\"pgc-132-0-0\"  class=\"panel-grid-cell\" ><div id=\"panel-132-0-0-0\" class=\"so-panel widget widget_sow-image panel-first-child panel-last-child\" data-index=\"0\" ><div\n\t\t\t\n\t\t\tclass=\"so-widget-sow-image so-widget-sow-image-default-dbf295114b96-132\"\n\t\t\t\n\t\t>\n\n<div class=\"sow-image-container\">\n\t\t<img title=\"Terms of Use\" alt=\"\" loading=\"lazy\" \t\tclass=\"so-widget-image\"\/>\n\t<\/div>\n\n<\/div><\/div><\/div><\/div><\/div><div id=\"pg-132-1\"  class=\"panel-grid panel-no-style\" ><div id=\"pgc-132-1-0\"  class=\"panel-grid-cell\" ><div id=\"panel-132-1-0-0\" class=\"so-panel widget widget_sow-editor panel-first-child panel-last-child\" data-index=\"1\" ><div\n\t\t\t\n\t\t\tclass=\"so-widget-sow-editor so-widget-sow-editor-base\"\n\t\t\t\n\t\t>\n<div class=\"siteorigin-widget-tinymce textwidget\">\n\t<h2 style=\"text-align: center;\">Terms of Use<\/h2>\n<h2>Work The Lead Terms of Use<\/h2>\n<p>Welcome to TeleDirect Call Centers (\"TeleDirect\"). TeleDirect and its affiliates provide their services to you subject to the following Terms of Use. Before you may use TeleDirect's services, you must read and accept all of the following Terms of Use.<\/p>\n<p>&nbsp;<\/p>\n<h2>Privacy<\/h2>\n<p>TeleDirect is committed to the protection of our customers' privacy. For a complete description of how we collect and subsequently use our customers' personal information, including the security measures we have implemented to protect the data, please review our Privacy Policy.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2>Phone Numbers<\/h2>\n<p>After purchasing your package of customer service you will select a phone number(s) to use in connection with your account. These phone numbers are and will always remain the property of TeleDirect Communications Inc. All usage of these numbers is at the sole discretion of TeleDirect Communications Inc. TeleDirect will deduct minutes for unused phone numbers. You may cancel a campaign at any time and avoid this deduction. 29 minutes will be deducted every 30 days for any phone number that has no usage. For example, if a phone number has 24 minutes of usage in 30 days, 5 minutes will be deducted from your balance of minutes.<\/p>\n<p>&nbsp;<\/p>\n<h2>Auto Protect<\/h2>\n<p>All accounts are required to enter a credit card number and keep it on file in your secure account for the Auto Protect system. The package you select will be automatically charged when your account is low in minutes. If your average daily usage of minutes indicates you will run out of minutes within 3 days, or you are below 50 minutes left in your account, the package you had selected will be charged overnight to your credit card on file. Advanced notification of your minute balance will be provided via email to indicate low minutes, totaling three (3) email notifications prior to any credit card charges. Accounts are not allowed to run into negative balances. If your account goes negative during the course of a day you will be charged for the negative balance amount plus your Auto Protect package amount.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2>Service<\/h2>\n<p>The minute package purchased from TeleDirect Communications Inc. is valid for the duration of the campaign and\/or for future campaigns should a minute balance remain on the account. The minutes purchased expire two years from the date of purchase. Fees paid for set up, training, custom reports and technology integration are non-refundable. TeleDirect provides a refund of unused and unexpired minutes upon request. Upon termination of services, any refund requested of the payments made in the first month will be subject to a 20% service fee and the balance on the account will be eligible for refund.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2> Client Charges and Rate Plans<\/h2>\n<p>The initial set up fees paid covers up to two (2) hours of set up, project design, training and scripting. Additional hours needed beyond the included hours for scripting will be billed at $150.00 per hour. Additional hours needed beyond the included hours for training will be billed at $27 per hour per agent. Specific technology integrations will also be billed at $150 per hour. Standard reporting is included free of charge. Custom reporting designed for a client will be billed at $150 per hour. A deduction of 30 minutes per holiday will apply to your account for New Year’s Day, President’s Day, Memorial Day, Independence Day, Labor Day, Thanksgiving Day and Christmas Day.<\/p>\n<p>&nbsp;<\/p>\n<h2>Credit Card Charge Backs or Holds<\/h2>\n<p>The charge on your credit card statement will appear as Tele-Direct Communications. If you request a charge back of this payment from your credit card company your account will be immediately disabled and your phone number(s) will be released. To restore your account, you must have the credit card charge back or hold removed and TeleDirect will then apply a $25.00 processing fee. Once your account has been disabled and your phone number(s), there is no guarantee that you will be able to use the same phone number(s).<\/p>\n<p>&nbsp;<\/p>\n<h2>Registration<\/h2>\n<p>Upon registration with TeleDirect, you will choose a User Name and Password for your account. You are responsible for maintaining the confidentiality of your User Name and Password and you agree that you are responsible for all activities that occur under your account and Password.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>In addition, please note that the TeleDirect Site is a general audience web site. By registering with TeleDirect, you represent that you are at least 13 years of age. If you are under 13 years of age, you should not register with us or provide information on this Site. We do not collect personal information from any person that we actually know is under the age of 13.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2>Content Submitted to and Collected by TeleDirect<\/h2>\n<p>You represent and warrant that you own or otherwise control all of the rights to the content that you upload into TeleDirect's system; that the content is accurate; that use of the content you supply does not violate this Terms of Use Agreement and will not cause injury to any person or entity; and that you will indemnify TeleDirect and its affiliates for all claims resulting from the content you supply. You agree that information you upload into TeleDirect's system for purposes of an outbound campaign complies with all applicable laws, including the Telemarketing Sales Rule and the National Do Not Call Registry, and you further agree to indemnify TeleDirect for any and all claims arising out of violations of the applicable laws regarding use of that information. TeleDirect may collect information on your behalf as part of an inbound or outbound campaign. TeleDirect will not re-sell or market that information, nor will TeleDirect share that information with third-parties without your prior consent, unless we believe that the law requires it, such as in response to subpoenas, court orders, or other legal processes, or to establish or exercise our legal rights or defend against legal claims, or you are using our salesforce.com integration software. If you are using our salesforce.com integration software, the information we collect on your behalf will be shared with salesforce.com when it is loaded into your salesforce.com organization.<\/p>\n<p>&nbsp;<\/p>\n<h2>Campaigns<\/h2>\n<p>TeleDirect will, to the best of its knowledge and judgment, only accept those campaigns that represent honest and ethical activity on the part of the client. If at any time, TeleDirect determines or becomes aware that the client is engaging in unethical or illegal activity, TeleDirect reserves the right to immediately cease providing all services and may demand immediate payment of any outstanding charges owed by the client. TeleDirect owns the toll-free telephone numbers it provides as part of its campaign service offerings. After a campaign is concluded or terminated, you may no longer use the phone numbers associated with that campaign.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2>Trademarks<\/h2>\n<p>The phrases \"TeleDirect,\" \"TeleDirect Call Centers,\" \"Seminar Edge,\" \"Work The Lead,\" and \"Fill The Lot\" are all trademarks owned by TeleDirect as are all designs and logos used by TeleDirect that incorporate those phrases. You agree not to use any of these trademarks in commerce, including by public display on any website or product, without TeleDirect's prior written permission. All trademarks not owned by TeleDirect or its affiliates that appear on this web site are the property of their respective owners, who may or may not be affiliated with, connected to, or sponsored by TeleDirect or its affiliates.<\/p>\n<p>&nbsp;<\/p>\n<h2>Notice and Procedure for Making Claims of Copyright or Intellectual Property Infringement<\/h2>\n<p>TeleDirect respects the intellectual property of others, and we ask our users to do the same. If you believe that your work has been copied in a way that constitutes copyright infringement or your intellectual property rights have been otherwise violated on this web site, please provide the following information to TeleDirect's Copyright Agent:<\/p>\n<p>&nbsp;<\/p>\n<ol>\n<li>an electronic or physical signature of the person authorized to act on behalf of the owner of the copyright or other intellectual property interest;<\/li>\n<li>a description of the copyrighted work or other intellectual property that you claim has been infringed;<\/li>\n<li>a description of where the material that you claim is infringing is located on the site;<\/li>\n<li>your address, telephone number, and email address;<\/li>\n<li>a statement by you that you have a good faith belief that the disputed use is not authorized by the copyright owner, its agent, or the law;<\/li>\n<li>a statement by you, made under penalty of perjury, that the above information in your Notice is accurate and that you are the copyright or intellectual property owner or authorized to act on the copyright or intellectual property owner's<\/li>\n<\/ol>\n<p>&nbsp;<\/p>\n<p>TeleDirect's Agent for notice of claims of copyright or other intellectual property infringement on this web site can be reached as follows:<\/p>\n<p>&nbsp;<\/p>\n<p>By mail:<\/p>\n<p>Copyright Agent<\/p>\n<p>c\/o TeleDirect Call Centers 4745 Chippendale Drive<\/p>\n<p>Sacramento, CA 95841 USA<\/p>\n<p>&nbsp;<\/p>\n<p>By phone: 800-776-1081<\/p>\n<p>By fax: 916-239-4227<\/p>\n<p>By email:<a href=\"mailto:billing@teledirect.com\"> billing@teledirect.com<\/a><\/p>\n<p>&nbsp;<\/p>\n<h2>Indemnity<\/h2>\n<p>You agree to indemnify and hold TeleDirect and its affiliates, officers, agents, employees, partners and licensors harmless from any claim or demand, including reasonable attorneys' fees, made by any third party due to or arising out of content you submit or otherwise make available through TeleDirect's web site, your use of or connection to TeleDirect's services, your violation of the Terms of Use, or your violation of any law or the rights of a third party.<\/p>\n<h2>General Information<\/h2>\n<p><strong> <\/strong><\/p>\n<p>Entire Agreement. The Terms of Use agreement constitutes the entire agreement between you and TeleDirect and governs your use of TeleDirect's services, superseding any prior agreements between you and TeleDirect with respect to our services. You may be subject to additional terms and conditions that may apply when you use or purchase certain other TeleDirect services, affiliate services, third-party content or third-party software.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>Governing Law and Forum. You agree that the Terms of Use shall be governed in all respects by the laws of the State of California, without regard to conflict of law provisions. You agree that any claim or dispute you may have against TeleDirect must be resolved by a court located in Sacramento County, California, except as otherwise agreed by the parties. You agree to submit to the personal jurisdiction of the courts located within Sacramento County, California for the purpose of litigating all such claims or disputes.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>Modification. Please review our other policies, such as our Privacy Policy, posted on this web site. These policies govern your visit to <a href=\"https:\/\/www.teledirect.com\/\">www.teledirect.com <\/a>and your use of TeleDirect's services. We reserve the right to make changes to our web site, policies, and these Terms of Use at any time.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>If any of these terms shall be deemed invalid, void, or for any reason unenforceable, that term shall be deemed severable and shall not affect the validity and enforceability of any remaining term. If there are material changes to the Terms of Use, we will post a link to our revised Terms of Use on our home page so that our users are always aware of the terms and conditions under which we provide services. In addition, our users will be required to review and accept the revised Terms of Use before accessing our services.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2>Disclaimer<\/h2>\n<p>Tele-Direct makes no warranty or representation, expressed or implied, that the services provided will be free from error, and that from time to time systems may malfunction. Client expressly relieves Tele-Direct from liability for any failure to perform if such failure is due to causes beyond the control of Tele-Direct, such as, acts of God, governmental action, fires, labor difficulties, equipment, computer malfunctions, and third-party vendors problems or outages, or the like.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<h2>Contact Information<\/h2>\n<p>If you have any questions regarding these Terms of Use, or any other general questions, please feel free to contact us by email at <a href=\"mailto:billing@teledirect.com\">billing@teledirect.com <\/a>or by mail at TeleDirect Call Centers, Attn: Accounting Dept., 4745 Chippendale Drive, Sacramento, CA 95841, USA.<\/p>\n<p>&nbsp;<\/p>\n<\/div>\n<\/div><\/div><\/div><\/div><\/div>","protected":false},"excerpt":{"rendered":"<p>Terms of Use Work The Lead Terms of Use Welcome to TeleDirect Call Centers (&#8220;TeleDirect&#8221;). TeleDirect and its affiliates provide their services to you subject&#8230;<\/p>\n","protected":false},"author":5,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_genesis_hide_title":false,"_genesis_hide_breadcrumbs":false,"_genesis_hide_singular_image":false,"_genesis_hide_footer_widgets":false,"_genesis_custom_body_class":"","_genesis_custom_post_class":"","_genesis_layout":"","footnotes":""},"acf":[],"_links":{"self":[{"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/pages\/132"}],"collection":[{"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/comments?post=132"}],"version-history":[{"count":0,"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/pages\/132\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.teledirect.com\/wp-json\/wp\/v2\/media?parent=132"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}